
&НаСервере
Процедура УдалитьЗаписиХранилищаОбщихНастроекНаСервере()
	
	КлючОбъекта         = "Общее/НастройкиНачальнойСтраницы";
	КлючОбъектаХранения = "Общее/НастройкиНачальнойСтраницыПередОчисткой";
	Попытка
		ХранилищеСистемныхНастроек.Удалить(КлючОбъекта, Неопределено, Неопределено);   
		Сообщить("Удалена настройка: "+КлючОбъекта);
	Исключение   
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	Попытка
		ХранилищеСистемныхНастроек.Удалить(КлючОбъектаХранения, Неопределено, Неопределено);
		Сообщить("Удалена настройка: "+КлючОбъектаХранения);
	Исключение 
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗаписиХранилищаОбщихНастроек(Команда)
	УдалитьЗаписиХранилищаОбщихНастроекНаСервере();
КонецПроцедуры
